import 'dart:convert';

import 'package:dartz/dartz.dart';
import 'package:shared_preferences/shared_preferences.dart';

import '../../domain/entities/Setting.dart';
import '../models/HadithModel.dart';
import '../models/SettingModel.dart';
import '../models/ZikerModel.dart';

abstract class ZikerLocalDataSource {
  Future<List<ZikerResponse>> getZikerList();
}

class ZikerLocalDataSourceImpl implements ZikerLocalDataSource {
  // \uFDFA -> ﷺ
  @override
  Future<List<ZikerResponse>> getZikerList() {
    final listOfZikerModel = <ZikerResponse>[
      ZikerResponse(
        1,
        "أَذْكَارُ ما بعد الاسْتِيقَاظِ مِنَ النَّومِ",
        <HadithResponse>[
          HadithResponse(
            1,
            "يمسح آثار النوم عن وجهه بكفِّه ، وقراءة العشر الآيات الأخيرة من سورة آل عمران :﴿ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ * ..... الآيات.",
            "البخاري 4569",
            1,
            0,
          ),
          HadithResponse(
              2,
              " (( الحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ)) وإذا انتبه من الليل قال: (( لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لهُ الْمُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْلِي))  \n  ",
              "البخاري 1154",
              1,
              0),
          HadithResponse(
              3,
              " الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْره  ",
              "الترمذي 3401",
              1,
              0),
        ],
      ),
      ZikerResponse(
        2,
        "أَذْكَارُ الصباح",
        <HadithResponse>[
          HadithResponse(1, "قراءة الاخلاص والمعوذتين  ",
              "أخرجه أبو داود (5082) \"يقال ثلاث مرات.\"", 3, 0),
          HadithResponse(
              2,
              "أصبحتُ أثني عليك حمدًا وأشهدُ أن لا إله إلا الله.  ",
              "أخرجه النسائي (10406) \"يقال ثلاث مرات.\"",
              3,
              0),
          HadithResponse(
              3,
              "أصبَحنا على فطرة الإسلام، وكلمة الإخلاص، وسُنَّة نبيِّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم، حنيفًا مسلمًا وما كان من المشركين. ",
              "أخرجه أحمد (15360)، الدارمي (2730)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              4,
              "اللهمَّ بك أصبَحنا، وبك أمسَينا، وبك نَحيا، وبك نموت، وإليك النشور.  ",
              "  أخرجه أبو داود (5068)، وابن حِبَّان (965) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              5,
              "أصبَحنا وأصبَح المُلك لله، والحمد لله، لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير، ربِّ أسألك خيرَ ما في هذا اليوم، وخيرَ ما بعده، وأعوذ بك من شرِّ هذا اليوم، وشرِّ ما بعده، ربِّ أعوذ بك من الكسل وسُوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار وعذابٍ في القبر.  ",
              "أخرَجه مسلم (2723)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              6,
              "لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير.  ",
              "\"يقال عشرات مرات ، أو مرة واحدة عند الكسل ، ومائة مرة في اليوم\" أخرَجه أبو داود (5077)، والنسائي في اليوم والليلة (27)",
              100,
              0),
          HadithResponse(
              7,
              "اللهم فاطِرَ السماواتِ والأرضِ ، عالِمَ الغيبِ والشهادةِ ، ربَّ كلِّ شئٍ ومليكَهُ ، أشهد أن لا إله إلا أنت ، أعوذ بك من شرِّ نفسى ، ومن شرِّ الشيطانِ وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم.  ",
              " أخرَجه أبو داود (5067)، والترمذي (3529)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              8,
              "اللهم إنى أسألك العافية فى الدنيا والآخرة ، اللهم إنى أسألك العفو والعافية فى دينى ، ودنياى ، وأهلى ، ومالى ، اللهم استر عَوْراتى ، وآمِن رَوْعاتي ، اللهم احفظنى من بين يدَىَّ ، ومن خلفى ، وعن يمينى ، وعن شمالى ، ومن فوقى ، وأعوذ بعظمتك أن أُغْتَالَ من تحتى.  ",
              "أخرَجه أبو داود (5074)، وابن ماجه (387)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              9,
              "اللهم إني أسألُك علمًا نافعًا ، ورزقًا طيبًا ، وعملًا متقبلًا.  ",
              "أخرجه ابن ماجه (٩٢٥)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(10, "سبحان الله وبحمده.  ",
              "أخرَجه مسلم (2692)\"يقال مائة مرة.\"", 100, 0),
          HadithResponse(
              11,
              "يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كلَّه، ولا تَكلني إلى نفسي طرْفة عين.  ",
              "أخرَجه النسائي في اليوم والليلة (570) \"يقال مرة واحدة\" ",
              1,
              0),
          HadithResponse(
              12,
              "اللهم أنت ربى لا إله إلا أنت خلقتنى وأنا عبدُكَ وأنا على عهدِكَ ووعدِكَ ما استطعتُ ، أعوذ بك من شرِّ ما صنعتُ ، أبوءُ لكَ بنعمتكَ علىَّ ، وأبوءُ لك بذنبى ؛ فاغفر لى ، فإنه لا يغفرُ الذنوب إلا أنت. ",
              "أخرَجه البخاري (6323) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              13,
              "بسم الله الذى لا يضرُّ مع اسمه شئٌ فى الأرضِ ولا فى السماءِ وهو السميعُ العليم.  ",
              "أخرجه أبو داود (٥٠٨٨) ، الترمذي ( ٢٣٨٨ ) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              14,
              "سبحان الله وبحمده عدد خلقه ، ورضا نفْسِهِ ، وزِنَةَ عرشه ، ومداد كلماته.  ",
              "أخرجه مسلم (2726) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              15,
              "رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمدٍ صلى الله عليه وسلم نبيًّا.  ",
              "أخرجه أبو داود (5072) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              16,
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْت.َ   ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              17,
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.  ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
        ],
      ),
      ZikerResponse(
        3,
        "الاذكار والدعوات دبر الصلواتَ المكتوبات",
        [
          HadithResponse(
              1,
              "الله أكبر، الله أكبر، الله أكبر \n" +
                  "        (( مع رفع الصوت قليلا ))  ",
              "رواه البخاري (842) ، مسلم (583) ",
              1,
              0),
          HadithResponse(
              2,
              "أستغفرُ اللهَ ثلاثًا، اللهمَّ أنتَ السَّلامُ، ومنك السَّلامُ، تبارَكْتَ يا ذا الجلالِ والإكرامِ. ",
              "رواه مسلم (591) ",
              1,
              0),
          HadithResponse(3, "قراءةُ المُعوِّذاتِ (الإخلاصِ والفلقِ والنَّاسِ) ",
              "رواه أبو داود (1523)، وغيره. ", 1, 0),
          HadithResponse(
              4,
              "لا إلهَ إلَّا اللهُ وحده لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، اللهمَّ لا مانعَ لِما أعطَيْتَ، ولا مُعطِيَ لِما منَعْتَ، ولا ينفَعُ ذا الجَدِّ منك الجَدُّ.«مع رفع الصوت» ",
              "رواه البخاري (844)، ومسلم (593) ",
              1,
              0),
          HadithResponse(
              5,
              "لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، لا حولَ ولا قوَّةَ إلَّا باللهِ، لا إلهَ إلَّا اللهُ، ولا نعبُدُ إلَّا إيَّاهُ، له النِّعمةُ وله الفضلُ، وله الثَّناءُ الحَسَنُ، لا إلهَ إلَّا اللهُ مُخلِصينَ له الدِّينَ ولو كرِهَ الكافرونَ.«مع رفع الصوت» ",
              "رواه مسلم (594) ",
              1,
              0),
          HadithResponse(6, "ربِّ قِنِي عذابَك يومَ تبعَثُ عِبادَكَ. ",
              "رواه مسلم (709) ", 1, 0),
          HadithResponse(
              7,
              "اللهمَّ أعِنِّي على ذِكرِكَ وشُكرِكَ وحُسْنِ عبادتِكَ. ",
              "رواه أبو داود (1522)، وغيره. ",
              1,
              0),
          HadithResponse(
              8,
              "اللهم إنى أسألك فِعلَ الخيرات وتَرْكَ المنكرات وحُبَّ المساكين وإذا أردتَ بعبادك فتنةً فاقبضني إليك غير مفتون. ",
              "رواه الترمذي (3233)  ",
              1,
              0),
          HadithResponse(
              9,
              "التسبيح وصفاته أربعة:\n١- سُبحانَ اللهِ عشْرَ مرَّاتٍ، والحمدُ للهِ عشْرَ مرَّاتٍ، واللهُ أكبَرْ عشْرَ مرَّاتٍ.\nرواه البخاري (6329)، ومسلم (595)\nأو :\n٢- سُبحانَ اللهِ خَمْسًا وعشرينَ مرَّةً، والحمدُ للهِ خَمْسًا وعشرينَ مرَّةً، واللهُ أكبَرْ خَمْسًا وعشرينَ مرَّةً، ولا إلهَ إلَّا اللهُ خَمْسًا وعشرينَ مرَّةً.\nرواه الترمذي (3413)، وغيره.\nأو :\n٣- سُبحانَ اللهِ ثلاثًا وثلاثينَ مرَّةً، والحمدُ للهِ ثلاثًا وثلاثينَ مرَّةً، واللهُ أكبَرُ أربعًا وثلاثيَن مرَّةً.\nرواه مسلم (596)\nأو : \n٤- سُبحانَ اللهِ ثلاثًا وثلاثينَ، والحمدُ للهِ ثلاثًا وثلاثينَ، واللهُ أكبَرُ ثلاثًا وثلاثينَ، ولا إلهَ إلَّا اللهُ وحدَه لا شريكَ له، له المُلكُ وله الحمدُ، وهو على كلِّ شيءٍ قديرٌ، مرَّةً تمامَ المائةِ.\nرواه مسلم (597)\nفائدة:\nوله الجمعُ بينها فيقولُ: سُبحانَ اللهِ والحمدُ للهِ واللهُ أكبَرُ، هكذا، ثلاثًا وثلاثينَ مرَّة\n\nًصفة العَقْدِ بالأناملِ:\nيُسَنُّ أنْ يَعُدَّ التسبيحَ والتحميدَ والتكبيرَ بعقدِ أصابِعه،نصَّ على ذلك الحنابلةُ،وهو قولُ النَّوويُّ،وابنُ تيميَّة،وابنُ القيِّم،والشَّوكانيُّ، وابنُ بازٍ، وابنُ عُثَيْمين\nرواه أبو داود (1501)، وغيره .",
              "",
              33,
              0),
          HadithResponse(
              10,
              "اللهمَّ اغفِرْ لي ما قدَّمْتُ وما أخَّرْتُ، وما أسرَرْتُ وما أعلَنْتُ، وما أسرَفْتُ وما أنت أعلَمُ به منِّي، أنتَ المُقدِّمُ وأنتَ المُؤخِّرُ، لا إلهَ إلَّا أنتَ. ",
              "رواه أبو داود (1509)، وغيره. ",
              1,
              0),
          HadithResponse(
              11,
              "اللهمَّ إني أعوذُ بك مِن الجُبْنِ، وأعوذُ بك مِن البُخلِ، وأعوذُ بك مِن أنْ أُرَدَّ إلى أرذَلِ العُمُرِ، وأعوذُ بك مِن فتنةِ الدُّنيا وعذابِ القبرِ. ",
              "رواه البخاري(6374) ",
              1,
              0),
        ],
      ),
      ZikerResponse(
        4,
        "أَذْكَارُ المساء",
        [
          HadithResponse(1, "قراءة الاخلاص والمعوذتين  ",
              "أخرجه أبو داود (5082) \"يقال ثلاث مرات\"", 3, 0),
          HadithResponse(
              2,
              "اللهمَّ بك أمسَينا، وبك أصبَحنا، وبك نَحيا وبك نموت، وإليك المصير.  ",
              "  أخرجه أبو داود (5068)، وابن حِبَّان (965) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              3,
              "أمسَينا وأمسى المُلك لله، والحمد لله، لا إله إلا الله وحْده لا شريك له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير، ربِّ أسألك خيرَ ما في هذه الليلة وخيرَ ما بعدها، وأعوذ بك من شرِّ ما في هذه الليلة وشرِّ ما بعدها، ربِّ أعوذ بك من الكسل وسوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار وعذابٍ في القبر.  ",
              "أخرَجه مسلم (2723)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              4,
              "لا إله إلا الله وحْده لا شريكَ له، له المُلك وله الحمد، وهو على كلِّ شيءٍ قدير.  ",
              "\"يقال عشرات مرات ، أو مرة واحدة عند الكسل ، ومائة مرة في اليوم\" أخرَجه أبو داود (5077)، والنسائي في اليوم والليلة (27)",
              100,
              0),
          HadithResponse(
              5,
              "اللهم فاطِرَ السماواتِ والأرضِ ، عالِمَ الغيبِ والشهادةِ ، ربَّ كلِّ شئٍ ومليكَهُ ، أشهد أن لا إله إلا أنت ، أعوذ بك من شرِّ نفسى ، ومن شرِّ الشيطانِ وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم.  ",
              " أخرَجه أبو داود (5067)، والترمذي (3529)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              6,
              "أمسينا على فطرة الإسلام، وكلمة الإخلاص، وسُّنة نبيِّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم، حنيفًا مسلمًا وما كان من المشركين.  ",
              " أخرَجه النسائي في اليوم والليلة (3)، والطبراني في الدعاء (293)،  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              7,
              "اللهم إنى أسألك العافية فى الدنيا والآخرة ، اللهم إنى أسألك العفو والعافية فى دينى ، ودنياى ، وأهلى ، ومالى ، اللهم استر عَوْراتى ، وآمِن رَوْعاتي ، اللهم احفظنى من بين يدَىَّ ، ومن خلفى ، وعن يمينى ، وعن شمالى ، ومن فوقى ، وأعوذ بعظمتك أن أُغْتَالَ من تحتى.  ",
              "أخرَجه أبو داود (5074)، وابن ماجه (387)  \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(8, "أعوذ بكلمات الله التامَّات من شرِّ ما خلَق.  ",
              "أخرَجه مسلم (2709)،   \"يقال ثلاث مرات\"", 3, 0),
          HadithResponse(9, "سبحان الله وبحمده  ",
              "أخرَجه مسلم (2692)\"يقال مائة مرة\"", 100, 0),
          HadithResponse(
              10,
              "يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كلَّه، ولا تَكلني إلى نفسي طرْفة عين.  ",
              "أخرَجه النسائي في اليوم والليلة (570) \"يقال مرة واحدة\" ",
              1,
              0),
          HadithResponse(
              11,
              "اللهم أنت ربى لا إله إلا أنت خلقتنى وأنا عبدُكَ وأنا على عهدِكَ ووعدِكَ ما استطعتُ ، أعوذ بك من شرِّ ما صنعتُ ، أبوءُ لكَ بنعمتكَ علىَّ ، وأبوءُ لك بذنبى ؛ فاغفر لى ، فإنه لا يغفرُ الذنوب إلا أنت.  ",
              "أخرَجه البخاري (6323) \"يقال مرة واحدة\"",
              1,
              0),
          HadithResponse(
              12,
              "بسم الله الذى لا يضرُّ مع اسمه شئٌ فى الأرضِ ولا فى السماءِ وهو السميعُ العليم.  ",
              "أخرجه أبو داود (٥٠٨٨) ، الترمذي ( ٢٣٨٨ ) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              13,
              "رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمدٍ صلى الله عليه وسلم نبيًّا.  ",
              "أخرجه أبو داود (5072) \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              14,
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْت.َ   ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد. \"يقال ثلاث مرات\"",
              3,
              0),
          HadithResponse(
              15,
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.  ",
              "أخرجه أبو داود (5090)، أحمد (20430)، بإسناد يحسن بالمتابعات والشواهد \"يقال ثلاث مرات\"",
              3,
              0),
        ],
      ),
      ZikerResponse(
        5,
        "أَذْكَارُ ما قبل النَّومِ",
        [
          HadithResponse(
              1,
              "جمع الكفين والنفث فيهما مع قراءة ﴿ قُلْ هُوَ اللَّهُ أَحَدٌ ﴾ و﴿ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴾ ، و﴿ قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴾ ، ثم يمسَح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه وما أقبل من جسده؛ يفعل ذلك ثلاث مرات. ",
              "«البخاري 5017» ",
              3,
              0),
          HadithResponse(2, "قراءة آية الكرسي. ", "«البخاري 2311» ", 1, 0),
          HadithResponse(
              3,
              "قراءة الآيتين من آخر سورة البقرة  ، فمَن قرأ بهما من ليلة كَفَتاه. ",
              "«البخاري 5009» ",
              1,
              0),
          HadithResponse(4, "قراءة : (سورتي بني إسرائيل- الإسراء - والزمر) ",
              "«الترمذي 2920» ", 1, 0),
          HadithResponse(
              5,
              "قراءة : ﴿ قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴾ ، ثمَّ نم على خاتمتها؛ فإنها براءة من الشِّرك) ",
              "«أبو داود 5055» ",
              1,
              0),
          HadithResponse(
              6,
              "قراءة : ﴿ الم * تَنْزِيلُ ﴾ السجدة، و﴿ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ ﴾ ",
              "«الترمذي 2892» ",
              1,
              0),
          HadithResponse(
              7,
              "وضع اليد تحتَ الخد ثم يقول: (( اللهم باسمك أموت وأحيا)) ",
              "«البخاري 6324» ",
              1,
              0),
          HadithResponse(
              8,
              "الله أكبر؛ أربعًا وثلاثين، وسبحان الله؛ ثلاثًا وثلاثين، والحمد لله؛ ثلاثًا وثلاثين. ",
              "«البخاري 5362» ",
              34,
              0),
          HadithResponse(
              9,
              "قول : (اللهمَّ أسلمتُ نفسي إليك، ووجهتُ وجهي إليك، وفوضتُ أمري إليك، وألجأتُ ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك، آمنتُ بكتابك الذي أنزلتَ ونبيك الذي أرسلتَ) ",
              "«البخاري 6311» ",
              1,
              0),
          HadithResponse(
              10,
              "ينفض فراشه بداخِلَةِ إزاره أو بصنفة ثوبه ثلاثَ مرات ، ويقول: باسمك ربِّي وضعتُ جنبي وبك أرفعه، إن أمسكتَ نفسي فارحمها، أو (فاغفر لها)، وإن أرسلتَها فاحفظها بما تحفظ به عبادَك الصالحين) ",
              " «البخاري 6320»",
              1,
              0),
          HadithResponse(
              11,
              "قول:(الحمد لله الذي أطعَمَنا وسقانا، وكفانا وآوانا، فكم ممن لا كافي له ولا مؤوي) ",
              "«مسلم 2715»",
              1,
              0),
          HadithResponse(
              12,
              "قول: (( الحمد لله الذي كفاني، وآواني، وأطعمني، وسقاني، والذي مَنَّ عليَّ فأفضل، والذي أعطاني فأجزل، الحمد لله على كلِّ حال، اللهم رب كل شيء ومليكه، وإله كل شيء، أعوذ بك من النار)) ",
              "«أخرجه أحمد 185/8»",
              1,
              0),
          HadithResponse(
              13,
              "قول: (( اللهمَّ فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شرِّ نفسي وشر الشيطان وشركه))، قال: (( قلها إذا أصبحتَ، وإذا أمسيتَ، وإذا أخذتَ مضجعك)) ",
              "«أبو داود 5069» ",
              1,
              0),
          HadithResponse(
              14,
              "قول: (( اللهمَّ قِني عذابك يوم تجمع أو تبعث عبادك)) ",
              "«الترمذي 3398» ",
              1,
              0),
          HadithResponse(
              15,
              "قول: (( أعوذ بكلمات الله التامَّة، من غضبه وعقابه، ومن شرِّ عباده، ومن همزات الشياطين، وأن يحضرون)) ",
              "«ابن السني 238» ",
              1,
              0),
          HadithResponse(
              16,
              "قول: (( اللهم رب السموات ورب الأرض ورب العرش العظيم، ربَّنا وربَّ كل شيء، فالق الحب والنَّوى ومنزل التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيء أنت آخذ بناصيته، اللهم أنت الأول فليس قبلك شيء، وأنت الآخِر فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطِن فليس دونك شيء، اقضِ عنا الدين وأغننا من الفقر)) ",
              "«مسلم 2713» ",
              1,
              0),
          HadithResponse(
              17,
              "قول: (( بسم الله وضعتُ جنبي، اللهمَّ اغفر لي ذنبي، وأخسئ شيطاني، وفكَّ رهاني، واجعلني في الندى الأعلى)) ",
              "«أبو داود 5054» ",
              1,
              0),
          HadithResponse(
              18,
              "قول: (( اللهم خلقتَ نفسي وأنت توفاها، لك مماتها ومحياها، إن أحييتَها فاحفظها وإن أمتَّها فاغفر لها، اللهمَّ إني أسألك العافية))، فقال له رجل: أسمعتَ هذا من عمر؟ فقال: من خير مِن عمر؛ من رسول الله صلى الله عليه وآله وسلم.",
              "«مسلم 2712»",
              1,
              0),
          HadithResponse(
              19,
              "قول: (( الحمد لله الذي كفاني وآواني، الحمد لله الذي أطعمني وسقاني، الحمد لله الذي مَنَّ عليَّ وأفضلَ، اللهمَّ إنِّي أسألك بعزَّتك أنْ تُنَجِّيَني من النَّار؛ فقدْ حَمِدَ الله بجميع محامدِ الخلقِ كلِّهم))",
              "«أخرجه الحاكم 546،545/1»",
              1,
              0),
          HadithResponse(
              20,
              "قول: (( اللهمَّ فاطِر السموات والأرض، عالمَ الغيب والشهادة، أنت ربُّ كل شيء، والملائكة يشهدون أنك لا إله إلا أنت، فإنا نعوذ بك من شرِّ أنفسنا، ومن شر الشيطان الرجيم وشركه، وأن نقترف سوءًا على أنفسنا أو نجرَّه إلى مسلم)) ",
              "«أبو داود 5083» ",
              1,
              0),
          HadithResponse(
              21,
              "قول: (( اللهمَّ فاطر السماوات والأرض، عالم الغيب والشهادة، رب كل شيء، وإله كل شيء، أشهد أن لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك، والملائكة يشهدون، اللهمَّ إني أعوذ بك من الشيطان وشركه، وأعوذ بك أن أقترف على نفسي إثمًا، أو أرده إلى مسلم)) ",
              "«الطبراني في المعجم الكبير 94/40/13» ",
              1,
              0),
        ],
      ),
      ZikerResponse(
        6,
        "من جوامع الدعاء من الصحيحين",
        [
          HadithResponse(
              1,
              "اللهم اجعل في قلبي نورًا، وفي بصري نورًا، وفي سمعي نورًا، وعن يميني نورًا، وعن يساري نورًا، وفوقي نورًا، وتحتي نورًا، وأمامي نورًا، وخلفي نورًا، واجعل لي نورًا. ",
              "متفق عليه (البخاري 6316، مسلم 763)",
              1,
              0),
          HadithResponse(
              2,
              "اللَّهمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كثِيرًا، وَلا يَغْفِر الذُّنوبَ إِلَّا أَنْتَ، فَاغْفِر لي مغْفِرَةً مِن عِنْدِكَ، وَارحَمْني، إِنَّكَ أَنْتَ الْغَفور الرَّحِيم. ",
              "متفق عليه (البخاري 834، مسلم2705)",
              1,
              0),
          HadithResponse(
              3,
              "اللَّهمَّ اغْفِر لي خَطِيئَتي وجَهْلي، وإِسْرَافي في أَمْري، وما أَنْتَ أَعلَم بِهِ مِنِّي، اللَّهمَّ اغفِرْ لي جِدِّي وَهَزْلي، وَخَطَئي وَعمْدِي، وَكلُّ ذلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَما أَسْررْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْت المقَدِّمُ، وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ عَلى كلِّ شَيْءٍ قَدِيرٌ.",
              "متفق عليه (البخاري 6398، مسلم 2719)",
              1,
              0),
          HadithResponse(
              4,
              "اللَّهُمَّ لَكَ أسْلَمْتُ، وبِكَ آمنْتُ، وعليكَ توَكَّلْتُ، وإلَيكَ أنَبْتُ، وبِكَ خاصَمْتُ، اللَّهُمَّ أعُوذُ بِعِزَّتِكَ، لا إلَه إلَّا أنْتَ أنْ تُضِلَّنِي، أنْت الْحيُّ الَّذي لا تمُوتُ، وَالْجِنُّ وَالإِنْسُ يمُوتُونَ.",
              "متفق عليه (البخاري 7383، مسلم 2717)",
              1,
              0),
          HadithResponse(
              5,
              "اللهُمَّ لك الحمد، أنت ربُّ السماوات والأرض، لك الحمد، أنت قيِّم السماوات والأرض ومَن فيهنَّ، لك الحمد أنت نور السماوات والأرض، قولك الحق، ووعدُك الحق، ولقاؤك حق، والجنة حق، والنار حق، والساعة حق، اللهُمَّ لك أسلمتُ، وبك آمنت، وعليك توكَّلت، وإليك أنبْتُ، وبك خاصمتُ، وإليك حاكمتُ؛ فاغفر لي ما قدَّمت وما أخَّرت، وأسررتُ وأعلنت، أنت إلهي لا إله لي غيرك.",
              "متفق عليه (البخاري 7385، مسلم769)",
              1,
              0),
          HadithResponse(
              6,
              "اللهُمَّ إني أعوذ بك من الكسل والهرَم، والمأثم والمغرَم، ومن فتنة القبر وعذابِ القبر، ومن فتنة النار وعذاب النار، ومن شرِّ فتنة الغِنى، وأعوذ بك من فتنة الفقر، وأعوذ بك من فتنة المسيح الدَّجَّال، اللهم اغسل عني خطايايَ بماء الثلج والبَرَد، ونقِّ قلبي من الخطايا كما نقَّيْتَ الثوب الأبيض من الدَّنَس، وباعِدْ بيني وبين خطاياي كما باعدتَ بين المشرق والمغرب.",
              "متفق عليه (البخاري 6368، مسلم 589)",
              1,
              0),
          HadithResponse(
              7,
              "عن النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وسَلَّم قَالَ: (( تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَماتَةِ الأَعْدَاءِ))",
              "متفق عليه (البخاري 6616، مسلم 2707)",
              1,
              0),
          HadithResponse(
              8,
              "اللهُمَّ إني أعوذُ بك من فتنة النار، ومن عذاب النار، وأعوذ بك من فتنة القبر، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة الغِنى، وأعوذ بك من فتنة الفقر، وأعوذ بك من فتنة المسيح الدَّجَّال.",
              "متفق عليه (البخاري 6376، مسلم 589)",
              1,
              0),
          HadithResponse(
              9,
              "كانَ أَكْثَرُ دُعَاءِ النبيِّ صَلَّى اللهُ عَلَيْهِ وسَلَّم: (( اللَّهُمَّ آتِنَا في الدُّنْيَا حَسَنَةً، وفي الآخِرةِ حَسنَةً، وَقِنَا عَذابَ النَّارِ))",
              "متفق عليه (البخاري 4522، مسلم 2690)",
              1,
              0),
          HadithResponse(
              10,
              "قَالَ النَّبِيُّ صلى الله عليه وسلم: (( لَا يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ، فَإِنْ كَانَ لَا بُدَّ فَاعِلًا فَلْيَقُلِ: اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي))",
              "متفق عليه (البخاري 5671، مسلم 2680)",
              1,
              0),
          HadithResponse(
              11,
              "اللهُمَّ ربَّ الناس مُذهِبَ الباس، اشْفِ أنت الشافي، لا شافي إلا أنت، شفاءً لا يُغادر سقمًا.",
              "(البخاري 5742)",
              1,
              0),
          HadithResponse(
              12,
              "سيِّد الاستغفار أن تقول: (( اللهُمَّ أنت ربِّي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شَرِّ ما صنعت، أبوء لك بنعمتك عليَّ، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت))، قال: (( ومَنْ قالها من النهار موقِنًا بها، فمات من يومه قبل أن يُمْسي، فهو من أهل الجنة، ومَنْ قالَها مِنَ الليل وهو موقِن بها، فمات قبل أن يُصبِح، فهو من أهل الجنة))",
              "(البخاري 6306)",
              1,
              0),
          HadithResponse(
              13,
              "اللهُمَّ باعِدْ بيني وبين خطاياي كما باعدتَ بين المشرق والمغرب، اللهُمَّ نقِّني من خطاياي كما يُنقَّى الثوبُ الأبيضُ مِن الدَّنَس، اللهُمَّ اغسِلْني من خطاياي بالثلج والماء والبَرَد.",
              "متفق عليه (البخاري 744، مسلم 598)",
              1,
              0),
          HadithResponse(
              14,
              "اللهُمَّ أعوذ برضاك مِن سخَطِك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أُحْصي ثناءً عليك، أنتَ كما أثنيت على نفسك.",
              "(مسلم 486)",
              1,
              0),
          HadithResponse(
              15, "ربِّ، قِني عذابَك يوم تبعثُ عبادَك.", "(مسلم 709)", 1, 0),
          HadithResponse(
              16,
              "أعوذ بكلماتِ اللهِ التامَّاتِ مِنْ شَرِّ ما خَلَق.",
              "(مسلم 2709)",
              1,
              0),
          HadithResponse(
              17,
              "أعوذُ باللهِ مِنَ الفِتَنِ؛ ما ظهَرَ منها وما بَطَن.",
              "(مسلم 2867)",
              1,
              0),
          HadithResponse(
              18,
              "اللهُمَّ ربَّ جبرائيل وميكائيل وإسرافيل، فاطر السموات والأرض، عالم الغيب والشهادة، أنت تحكم بين عبادك فيما كانوا فيه يختلفون، اهدِني لما اختُلِف فيه من الحقِّ بإذنك؛ إنك تهدي مَن تشاء إلى صراطٍ مستقيمٍ.",
              "(مسلم 770)",
              1,
              0),
          HadithResponse(
              19,
              "اللهُمَّ أنت الملك، لا إله إلا أنت، أنت ربي، وأنا عَبْدُك، ظلمتُ نفسي، واعترفت بذنبي، فاغفر لي ذنوبي جميعًا، إنه لا يغفر الذنوب إلا أنت، واهدِني لأحسن الأخلاق، لا يهدي لأحسنها إلا أنت، واصرِف عني سيِّئَها، لا يصرف عني سيئها إلا أنت، لبَّيْك وسعديك، والخير كلُّه في يديك، والشرُّ ليس إليك، أنا بكَ وإليك، تباركتَ وتعاليت، أستغفرك وأتوب إليك.",
              "(مسلم 771)",
              1,
              0),
          HadithResponse(
              20,
              "اللهُمَّ ربَّ السموات وربَّ الأرض وربَّ العرش العظيم، ربنا ورب كل شيءٍ، فالقَ الحَبِّ والنَّوى، ومنزلَ التوراة والإنجيل والفُرْقان، أعوذ بك من شرِّ كل شيءٍ أنت آخذٌ بناصيته.",
              "(مسلم 2713)",
              1,
              0),
          HadithResponse(
              21,
              "اللهُمَّ أنت الأوَّلُ فليس قبلك شيء، وأنت الآخِرُ فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطن فليس دونك شيء؛ اقضِ عنا الدَّين، وأغنِنا من الفقر.",
              "(مسلم 2713)",
              1,
              0),
          HadithResponse(
              22,
              "اللهُمَّ مُنْزِلَ الكتاب، ومجرِيَ السحاب، وهازم الأحزاب، اهزمهم، وانصرنا عليهم.",
              "متفق عليه (البخاري 3025، مسلم 1742)",
              1,
              0),
          HadithResponse(
              23,
              "اللهُمَّ إني أعوذ بك من زوال نعمتك، وتحوُّل عافيتك، وفُجاءة نِقْمتك، وجميع سخَطك.",
              "(مسلم 2739)",
              1,
              0),
          HadithResponse(
              24,
              "اللهُمَّ إني أعوذ بك من شَرِّ ما عَمِلتُ، ومن شَرِّ ما لم أعمل.",
              "(مسلم 2716)",
              1,
              0),
          HadithResponse(25, "اللهُمَّ مُصرِّف القلوب، صرِّف قلوبنا على طاعتك.",
              "(مسلم 2654)", 1, 0),
          HadithResponse(
              26,
              "كان رسولُ اللَّه صلى الله عليه وسلم يُكْثِرُ أنْ يَقولَ قبْلَ أَنْ يَمُوتَ: (( سُبْحانَكَ اللَّهُمَّ وبِحْمدِكَ، أسْتَغْفِركَ وأتُوبُ إلَيْكَ))",
              "(مسلم 484)",
              1,
              0),
          HadithResponse(
              27,
              "قالَ رَسُولُ اللَّه صلى الله عليه وسلم: (( لأن أَقُولَ سبْحانَ اللَّهِ، وَالحَمْدُ للَّهِ، ولا إلَه إلَّا اللَّه، وَاللَّه أكْبرُ، أَحبُّ إليَّ مِمَّا طَلَعَت عليهِ الشَّمْسُ))",
              "(مسلم 2695)",
              1,
              0),
          HadithResponse(
              28,
              "جاءَ أَعْرَابي إلى رسُولِ اللَّه صلى الله عليه وسلم فقالَ: علِّمْني كَلامًا أَقُولُهُ، قالَ: (( قُل لا إله إلَّا اللَّه وحدَهُ لا شرِيكَ لهُ، اللَّه أَكْبَرُ كَبِيرًا، والحمْدُ للَّهِ كَثيرًا، وسُبْحانَ اللَّه ربِّ العالمِينَ، ولا حوْل وَلا قُوَّةَ إلَّا باللَّهِ العَزيز الحكيمِ))، قال: فَهؤلاء لِرَبِّي، فَما لي؟ قال: (( قُل: اللَّهُمَّ اغْفِرْ لي وارْحمني، واهْدِني، وارْزُقْني))",
              "(مسلم 2696)",
              1,
              0),
          HadithResponse(
              29,
              "َانَ الرَّجلُ إِذا أَسْلَمَ عَلَّمَهُ النَّبيُّ صلى الله عليه وسلم الصَّلاةَ، ثُمَّ أَمَرَهُ أَنْ يَدعُوَ بهَؤُلاءِ الكَلِمَاتِ: (( اللَّهُمَّ اغفِرْ لي، وَارْحمْني، واهْدِني، وعافِني، وارْزُقني))",
              "(مسلم 2697)",
              1,
              0),
          HadithResponse(
              30,
              "اللَّهُمَّ أَصْلِحْ لي دِيني الَّذي هُوَ عِصْمَةُ أَمْرِي، وأَصْلِحْ لِي دُنْيَايَ التي فِيهَا مَعَاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيها معادي، وَاجْعلِ الحيَاةَ زِيادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ الموتَ راحَةً لي مِنْ كُلِّ شَرٍّ.",
              "(مسلم 2720)",
              1,
              0),
          HadithResponse(
              31,
              "عنْ عليٍّ رَضِيَ اللَّه عَنْهُ، قَالَ: قال لي رَسُولُ اللَّهِ صلى الله عليه وسلم: (( قُلْ: اللَّهُمَّ اهْدِني، وَسدِّدْني))\n وَفي رِوَايةٍ: (( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدى، وَالسَّدَادَ))",
              "(مسلم 2725)",
              1,
              0),
          HadithResponse(
              32,
              "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، والبُخْلِ وَالهَرم، وعَذَاب الْقَبْر، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيرُ مَنْ زَكَّاهَا، أَنْتَ ولِيُّهَا وَموْلاهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلمٍ لا يَنْفَعُ، ومِنْ قَلْبٍ لا يخْشَعُ، وَمِنْ نَفْسٍ لا تَشبَعُ، ومِنْ دَعْوةٍ لا يُسْتجابُ لهَا.",
              "(مسلم 2722)",
              1,
              0),
          HadithResponse(
              33,
              "اللَّهُمَّ إِنِّـي أَعُوذُ بِكَ مِنَ الْعجْزِ والكَسَلِ وَالجُبْنِ وَالهَرَمِ، وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ المَحْيا وَالمَمَاتِ.\nوفي رِوايةٍ: (( وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ))",
              "متفق عليه (البخاري 6369، مسلم 2706)",
              1,
              0),
          HadithResponse(
              34,
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعفَافَ، والغِنَى.",
              "(مسلم 2721)",
              1,
              0),
        ],
      ),
      ZikerResponse(7, 'ما كان يقرأ به ﷺ في صلاة الفجر', [
        HadithResponse(
            1,
            'وكان يقرأ فيها ما بين الستين إلى المائة آية - وكان يُطَوّل في الركعة الأولى، ويُقَصِّر في الثانية.',
            '- متفق عليه: رواه الإمام البخاري (771)، ومسلم (647). عن أبي برزة الاسلمي \n' +
                '- عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ ، عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ فِي الْأُولَيَيْنِ بِأُمِّ الْكِتَابِ وَسُورَتَيْنِ، وَفِي الرَّكْعَتَيْنِ الْأُخْرَيَيْنِ بِأُمِّ الْكِتَابِ، وَيُسْمِعُنَا الْآيَةَ، وَيُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى مَا لَا يُطَوِّلُ فِي الرَّكْعَةِ الثَّانِيَةِ، وَهَكَذَا فِي الْعَصْرِ، وَهَكَذَا فِي الصُّبْحِ.( متفق عليه )، البخاري برقم (776) ومسلم برقم (451)',
            1,
            0),
        HadithResponse(
            2,
            'سورة (المؤمنون)\n' +
                'عن عبد الله بن السائب رضي الله عنه قال: صلى لنا النبي ﷺ الصبح بمكة فاستفتح سورة «المؤمنين» حتى جاء ذكر موسى وهارون – أو ذكر عيسى – أخذت النبي ﷺ سعلةٌ فركع.',
            'رواه الامام مسلم برقم (455) والامام ابن ماجه برقم(820).',
            1,
            0),
        HadithResponse(
            2,
            'سورة (الروم)\n' +
                'عن شبيب أبي روح ، عن رجل من أصحاب النبي ﷺ عن النبي ﷺ، أنه صلى صلاة الصبح فقرأ الروم، فالتبس عليه، فلما صلى قال : " ما بال أقوام يصلون معنا، لا يحسنون الطهور، فإنما يلبس علينا القرآن أولئك ',
            'حسن : رواه الامام أحمد برقم (15872 ،15873) والنسائي (947).',
            1,
            0),
        HadithResponse(
            3,
            'سورة (يس)\n' +
                'عن جابر بن سَمُرة رضي الله عنه أن النيي ﷺ كان يقرأ في الصبح بـ: {يس}',
            'رواه الطبراني في " الأوسط "، ورجاله رجال " الصحيح ". كذا " المجمع " (2/119) . وقال الامام الالباني رحمه الله في صفة صلاة النبي ﷺ ( 2/440) : {وسنده جيد. هذا هو الذي استقر عليه الرأي أخيراً؛ خلافاً لما كنت ذكرته في " تمام المنة "(ص 180) وغيره؛ فليُعلم} .',
            1,
            0),
        HadithResponse(
            4,
            'سورة (الصافات)\n' +
                'عن ابن عمر رضي الله عنهما قال: إن كان رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ليأمرنا بالتخفيف، وإن كان لَيَؤُمُّنا بـ: {الصَّافَّات} قال يزيد :في الصبح.',
            'اسناده حسن ، أخرجه الامام أحمد برقم (4989) ، وأبو يعلى [5/42/5422]',
            1,
            0),
        HadithResponse(
            5,
            'سورة (ق)\n' +
                'عن قطبة بن مالك رضي الله عنه قال: صليت وصلى بنا رسول الله ﷺ فقرأ: {قَ وَالْقُرْآنِ الْمَجِيدِ} حتى قرأ : {وَالنّخْلَ بَاسِقَاتٍ ...} ' +
                '\n- عن جابر بن سمرة رضي الله عنه أن النبي ﷺ كان يقرأ في الفجر بــ {قَ وَالْقُرْآنِ الْمَجِيدِ}،  وَكَانَ صَلَاتُهُ بَعْدُ تَخْفِيفًا.',
            'رواه الامام مسلم برقم (457).' +
                '\n- رواه الامام مسلم في صحيحه برقم (458).',
            1,
            0),
        HadithResponse(
            6,
            'سورة (الطور)\n' +
                'عن أم سلمة رضي الله عنها قالت: إن رسول الله ﷺ «قال لها - لما شكت لـه - إذا أقيمت صلاة الصبح - فطوفي على بعيرك والناس يصلون» . وورد التصريح بالسورة التي كان يقرأ بها ﷺ في الصحيحين في رواية قالت: فطفت ورسول الله ﷺ حينئذ يصلي إلى جنب البيت وهو يقرأ: {وَالطّورِ * وَكِتَابٍ مّسْطُورٍ }. أخرجه البخاري ومسلم.',
            'رواه الامام البخاري برقم (1626). رواها الامام البخاري برقم (1619) والامام مسلم برقم (1276).',
            1,
            0),
        HadithResponse(
            7,
            'سورة (الواقعة)\n' +
                'وعنه قال: كان النبي ﷺ يصلي نحواً من صلاتكم، لكنه كان يخفف الصلاة، كان يقرأ في صلاة الفجر بالواقعة ونحوها من السور. ',
            'رواه ابن خزيمة في صحيحه برقم (530).',
            1,
            0),
        HadithResponse(
            8,
            'سورة( التكوير )\n' +
                'عن عمــرو بن حـــريث رضي الله عنه أنـه سمع النبـي ﷺ يقـــرأ في الفجـــر {وَاللّيْلِ إِذَا عَسْعَسَ} ',
            'اخرجه الامام برقم مسلم (456) وأبو داود برقم (817)، والنسائي وصرح باسم السورة برقم (951)',
            1,
            0),
        HadithResponse(
            9,
            'سورة ( الزلزلة ) في الركعتين كلتيهما\n' +
                'عن رجل من جهينة أنه سمع النبي ﷺ يقرأ في الصبح  {إِذَا زُلْزِلَتِ الأرْضُ زِلْزَالَهَا} في الركعتين كلتيهما فلا أدري: أنسي رسول الله - ﷺ - أم قرأ ذلك عمداً؟ ',
            'حسن : رواه الامام أبو داود برقم (816).',
            1,
            0),
        HadithResponse(
            10,
            'سورة (الفلق والناس) المعوذتين ، قرأ بهما مرة في السفر\n' +
                'عن عقبة بن عامر رضي الله عنه قال: كنت أقود برسول الله ﷺ ناقته في السفر، فقال لي: (يا عقبة ألا أعلمك خير سورتين قرئتا)؟ فعلَّمني: {قُلْ أَعُوذُ بِرَبّ الْفَلَقِ} و{قُلْ أَعُوذُ بِرَبّ النّاسِ} قال: فلم يرني سُررت بهما جداً، قال: فلما نزل لصلاة الصبح صلّى بهما صلاة الصبح للناس، فلما فرغ رسول الله ﷺ من الصلاة التفت إليَّ فقال: (يا عقبة كيف رأيت؟). ',
            ' صحيح رواه الامام أبو داود في سننه برقم (1462 و 1463).',
            1,
            0),
      ]),
      ZikerResponse(8, 'ما كان يقرأ به ﷺ في صلاتي الظهر والعصر', [
        HadithResponse(
            1,
            '- كان يقرأ  قدر سورة السجدة أو قدر ثلاثين آية،  ويُطَوِّلُ في الأولى ما لا يُطَوِّل في الثانية\n' +
                '- عن أبي سعيد الخدري رضي الله عنه قال: كنا نحزر قيام رسول الله ﷺ في الظهر والعصر فحزرنا قيامه في الركعتين الأوليين من الظهر قدر قراءة: { الم * تَنزِيلُ ...} - السجدة – وحَزَرْنا قيامه في الأخريين قدر النصف من ذلك. وحَزَرْنا قيامه في الركعتين الأوليين من العصر على قدر قيامه في الأخريين من الظهر. وفي الأخريين من العصر على النصف من ذلك. وفي رواية قدر ثلاثين آية.\n' +
                '- عن أبي قتادة رضي الله عنه قال: كان النبي ﷺ «يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، وكان يُطوِّلُ في الأولى ويقصر في الثانية، ويُسِمعُ الآية أحياناً وكان يقرأ في صلاة العصر بفاتحة الكتاب وسورتين وكان يُطوِّلُ في الأولى، وكان يُطوِّلُ في الركعة الأولى من صلاة الصبح ويقصر في الثانية».',
            '- قال الامام الالباني في صفة الصلاة : هو من حديث أبي قتادة - رضي الله عنه أن النبي ﷺ كان يقرأ في الظهر في الأوليين بـ: {أم الكتاب} وسورتين، وفي الركعتين الأخريين بـ: {أم الكتاب} ، ويُسْمِعُنا الآية [أحياناً] ، ويطول في الركعة الأولى ما لا يطول في الركعة الثانية، وهكذا في العصر، وهكذا في الصبح. أخرجه البخاري في " صحيحه " (2/193 - 194 و 207) وفي " جزئه " (24) ،ومسلم (2/37) ، وأبو داود (1/127 - 128) ، والنسائي (1/153) ، والدارمي (1/296) ،وابن ماجه (1/274 - 275) ، والطحاوي (1/131) مختصراً، والبيهقي (2/59 و 63و65 - 66 و 193 و 347 - 348) ، وأحمد (5/295 و 297 و 300 و 301 و 305 و 307و311 و 4/383) من طرق عن يحيى بن أبي كثير عن عبد الله بن أبي قتادة عن أبيه به.' +
                '\n- رواه الامام مسلم (452) وأبو داود (804) وابن خزيمة (509)' +
                '\n- البخاري (759) ومسلم (451) وأبو داود (798).',
            1,
            0),
        HadithResponse(
            2,
            'سورة ( الأعلى والغاشية )' +
                '- عن أنس بن مالك رضي الله عنه عن النبي رضي الله عنه أنهم كانوا يسمعون منه النغمة في الظهر بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و {هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ} ' +
                '\n- عن عمران بن حصين رضي الله عنه أن رسول الله ﷺ صلّى الظهر، فجعل رجلٌ يقرأ بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ}. فلما انصرف قال: أيكم قرأ أو أيكم القارئ؟ فقال رجل: أنا فقال: فقد ظننت أن بعضكم خالجنيها – نازعني قرائتها ',
            '\n- رواه الامام ابن خزيمة برقم (512).' + '\n- أخرجه مسلم (398).',
            1,
            0),
        HadithResponse(
            3,
            'سورة ( الأعلى والشمس )\n' +
                'عن جابر بن سمرة رضي الله عنه «أن النبي - ﷺ - كان يقرأ في الظهر بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} ، وفيه {وَالشّمْسِ وَضُحَاهَا} ونحوها، ... \n',
            'صحيح : رواه الامام ابن خزيمة في صحيحه برقم (510).',
            1,
            0),
        HadithResponse(
            4,
            'سورة ( الانشقاق ) ' +
                '\nعن بريدة الأسلمي رضي الله عنه أن النبي ﷺ كان يقرأ في الظهر بــ {إِذَا السّمَآءُ انشَقّتْ} ونحوها.',
            'رواه الامام ابن خزيمة في صحيحة برقم (511).',
            1,
            0),
        HadithResponse(
            5,
            'سورة ( البروج والطارق )' +
                '\nعن جابر بن سمرة رضي الله عنه أن رسول الله ﷺ كان يقرأ في الظهر والعصر بـــ {وَالسّمَآءِ ذَاتِ الْبُرُوجِ}و{وَالسّمَآءِ وَالطّارِقِ}.',
            'صحيح: رواه الامام الترمذي برقم (307) ، والامام النسائي برقم (979)',
            1,
            0),
        HadithResponse(
            6,
            'سورة ( الليل )' +
                '\nعن جابر بن سمرة رضي الله عنه قال: كان رسول الله ﷺ يقرأ في الظهر بــ {وَالْلّيْلِ إِذَا يَغْشَىَ} وفي العصر نحو ذلك، وفي الصبح أطول من ذلك. ',
            'رواه الامام مسلم برقم (459) ، والامام أبو داود برقم (806).',
            1,
            0),
      ]),
      ZikerResponse(9, 'ما كان يقرأ به ﷺ في صلاة المغرب', [
        HadithResponse(
            1,
            'سورة ( الاعراف ):' +
                '\n-عن مروان بن الحكم قال: قال لي زيد بن ثابت رضي الله عنه مالك تقرأ في المغرب بقصارٍ؟ وقد سمعتُ النبي ﷺ يقرأ بطُولى الطوليين ' +
                '\n-عن عائشة رضي الله عنها  أن رسول الله ﷺ قرأ في صلاة المغرب سورة الأعراف فرقها في ركعتين. ',
            '- رواه الامام البخاري برقم (764) وأبو داود برقم (812). وطولى الطولين الاعراف ' +
                '\n- صحيح : رواه الامام النسائي برقم (991). ذهب أبو داود في سننه إلى نسخ التطويل في المغرب، ودلل ابن دقيق باستمرار العمل على التخفيف. ورد ذلك الحافظ في الفتح .',
            1,
            0),
        HadithResponse(
            2,
            'سورة ( الأنفال )' +
                '\nعن أبي أيوب الانصاري رضي الله عنه:أن النبي ﷺ كان يقرأ في المغرب سورة {الأَنْفَال}. ',
            'رواه الطبراني في " الكبير " {بسندٍ صحيح} ، ورجاله رجال " الصحيح ".',
            1,
            0),
        HadithResponse(
            3,
            'سورة ( محمد ﷺ)' +
                '\nعن ابن عمر رضي الله عنهما أن النبي ﷺ قرأ بهم في المغرب بـ: {الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ} .',
            '((  أخرجه الطبراني في " الصغير " (ص 23) وفي " الكبير " أيضاً، والمقدسي في" المختارة " من طريق الحسين بن حُرَيث المَرْوَزي: ثنا أبو مُعاوية محمد بن خازِم: ثنا عبيد الله بن عمر عن نافع عنه: قال الالباني : وهذا سند صحيح على شرط الشيخين.',
            1,
            0),
        HadithResponse(
            4,
            'سورة ( الطور )' +
                '\n عن جبير بن مطعم رضي الله عنه قال: سمعت رسول الله ﷺ قرأ في المغرب بالطور. ',
            'متفق عليه : رواه الامام البخاري برقم (765) ، والامام مسلم برقم (463).',
            1,
            0),
        HadithResponse(
            5,
            'سورة ( المرسلات )' +
                '\nعن ابن عباس رضي الله عنه قال: إن أم الفضل سمعته وهو يقرأ:{وَالْمُرْسَلاَتِ عُرْفاً} فقالت: يا بني ، والله لقد ذكرتني بقراءتك هذه السورة إنها لآخر ما سمعتُ من رسول الله ﷺ يقرأ بها في المغرب.',
            'متفق عليه : رواه الامام البخاري برقم (763)، والامام مسلم برقم (462).',
            1,
            0),
        HadithResponse(
            6,
            'قصار المفصل ' +
                'عَنْ سُلَيْمَانَ بْنِ يَسَارٍ ، عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ : مَا صَلَّيْتُ وَرَاءَ أَحَدٍ أَشْبَهَ صَلَاةً بِرَسُولِ اللَّهِ ﷺ مِنْ فُلَانٍ. قَالَ سُلَيْمَانُ : كَانَ يُطِيلُ الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنَ الظُّهْرِ، وَيُخَفِّفُ الْأُخْرَيَيْنِ، وَيُخَفِّفُ الْعَصْرَ، وَيَقْرَأُ فِي الْمَغْرِبِ بِقِصَارِ الْمُفَصَّلِ، وَيَقْرَأُ فِي الْعِشَاءِ بِوَسَطِ الْمُفَصَّلِ، وَيَقْرَأُ فِي الصُّبْحِ بِطُوَلِ الْمُفَصَّلِ.',
            '\n- سمي بالمفصل لأمور لما قاله ابن مفلح في الآداب الشرعية (2/283) : "وفي تسميته بالمفصل للعلماء أربعة أقوال: أحدها: لفصل بعضه عن بعض. والثاني: لكثرة الفصل بينها ببسم الله الرحمن الرحيم. الثالث: لإحكامه. والرابع : لقلة المنسوخ فيه".وقال النووي في شرح مسلم (3/368): "وسمي مفصلاً لقصر سوره وقرب انفصال بعضهن من بعض" وقال السيوطي في الإتقان(1/222): "سمي بذلك لكثرة الفصول التي بين السور بالبسملة، وقيل: لقلة المنسوخ منه، ولهذا يسمى المحكم أيضاً".    وهذا الذي ذكره السيوطي قد رواه البخاري برقم (5035). عن سعيد بن جبير قال: "إن الذي تدعونه المفصل هو المحكم قال: وقال ابن عباس: توفي رسول الله ﷺ وأنا ابن عشر سنين وقد قرأت المحكم".    ثالثاً : قال السيوطي في الإتقان:(1/223)."فائدة: للمفصل طوال وأوساط وقصار. قال ابن معن: فطواله إلى «عمّ» وأوساطه منها إلى «الضحى» ومنها إلى آخر القرآن قصاره، وهذا أقرب ما قيل".' +
                '\n- صحيح : رواه الامام النسائي برقم (982)' +
                '\n- قال ابن القيم في الزاد:" وأما المغرب فكان هديه فيها خلاف عمل الناس اليوم فإنه صلاها مرة بـ (الأعراف) فرقها في الركعتين ومرة بـ (الطور) ومرة بـ (المرسلات) . قال أبو عمر بن عبد البر: روي عن النبي صلى الله عليه و سلم أنه قرأ في المغرب بـ (المص) وأنه قرأ فيها بـ (الصافات) وأنه قرأ فيها بـ (حم الدخان) وأنه قرأ فيها بـ (سبح اسم ربك الأعلى) وأنه قرأ فيها بـ (التين والزيتون) وأنه قرأ فيها بـ (المعوذتين) وأنه قرأ فيها بـ (المرسلات) وأنه كان يقرأ فيها بقصار المفصل قال: وهى كلها آثار صحاح مشهورة انتهى (زاد المعاد:1/ 203).    حتى إنهم  كانوا إذا صلَّوا معه، وسلَّم بهم؛ انصرف أحدهم وإنه ليُبْصِرُ مَواقعَ نَبْلِه . متفق عليه عن رافع بن خَدِيج قال: كنا نصلي المغرب مع النبي ﷺ ، فينصرف أحدنا وإنه ليبصر مواقع نبله. أخرجه البخاري (559) ، ومسلم (637)',
            1,
            0),
        HadithResponse(
            999,
            'سورة ( التين) قرأ بها ﷺ في الركعة الثانية في سفر' +
                '\nعن البراء بن عازب رضي الله عنه قال: كنت مع رسول الله ﷺ في سفر، فقرأ في المغرب في الركعة الثانية بـ: {التِّينِ وَالزَّيْتُونِ}.',
            '\nقال الالباني في صفته (2/475) : أخرجه الطيالسي (99) قال: ثنا شعبة عن عدي بن ثابت سمع البراء قال :كنت مع رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ في سفر، فقرأ في المغرب في الركعة الثانية بـ: {التِّينِ وَالزَّيْتُونِ} .وهذا سند صحيح على شرط الشيخين.',
            1,
            0),
      ]),
      ZikerResponse(10, 'ما كان يقرأ به ﷺ في صلاة العشاء', [
        HadithResponse(
            1,
            'سورة ( الانشقاق )' +
                '\n عن أبي رافع قال: صليتُ مع أبي هريرة رضي الله عنه العتمة – أي العشاء - فقرأ: {إِذَا السّمَآءُ انشَقّتْ} فسجد فقلت: ما هذه؟ قال: سجدت بها خلف أبي القاسم ﷺ فلا أزال أسجد بها حتى ألقاه. ',
            'متفق عليه : رواه الامام البخاري برقم (768) ومسلم برقم (578).',
            1,
            0),
        HadithResponse(
            2,
            'سورة ( الاعلى والشمس و الليل )' +
                '\nعن جابر بن عبد الله رضي الله عنهما أن رسول الله ﷺ قال لمعاذ في صلاة العشاء: فلولا صليت بــ {سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و{وَالشّمْسِ وَضُحَاهَا} و {وَالْلّيْلِ إِذَا يَغْشَىَ} فإنه يصلي وراءك الكبير والضعيف وذو الحاجة» أخرجه البخاري ومسلم.',
            'البخاري (705) ومسلم (465).',
            1,
            0),
        HadithResponse(
            3,
            'سورة ( التين )' +
                '\nعن البراء بن عازب رضي الله عنه أن النبي ﷺ كان في سفرٍ فقرأ في العشاء في إحدى الركعتين بــ «التين والزيتون». ',
            'متفق عليه : رواه الامام البخاري برقم (767) ومسلم برقم (464).',
            1,
            0),
      ]),
      ZikerResponse(11, 'ما كان يقرأ به ﷺ  في صلاة  الوتر', [
        HadithResponse(
            1,
            'سورة ( الأعلى و الكافرون و الإخلاص)' +
                '\nعن أبيّ بن كعب - رضي الله عنه - : أن رسول الله - ﷺ - كان يقرأ في الأولى بـــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ}. وفي الثانية بـــ{قُلْ يَأَيّهَا الْكَافِرُونَ}. وفي الثالثة بــ{قُلْ هُوَ اللّهُ أَحَدٌ}. فإذا فرغ قال عند فراغه: (سبحان الملك القدوس) ثلاث مرات يطيل آخرهن. ',
            'رواه الامام النسائي برقم (1699) وبرقم (1702) بنحوه عن ابن عباس ) وابن ماجه (1171، 1172 بنحوه عن ابن عباس).',
            1,
            0),
      ]),
      ZikerResponse(12, 'ما كان يقرأ به ﷺ  في فجر الجمعة', [
        HadithResponse(
            1,
            'سورة ( السجدة والانسان ) ' +
                '\nعن أبي هريرة رضي الله عنه قال:كان النبي ﷺ  يقرأ في الجمعة في صلاة الفجر{ الم * تَنزِيلُ ...} السجدة و {هَلْ أَتَىَ عَلَى الإِنسَانِ ...}. ',
            '- قال الشيخ الامام عبد العزيز بن باز -رحمه الله تعالى-: هذه سنة ثابتة عن النبيﷺ  «فيشرع للإمام قراءة هاتين السورتين في فجر الجمعة وإن كره ذلك بعض الجماعة لكسلهم» . فتاوى ابن باز (12/393) .' +
                '\n- متفق عليه : رواه الامام البخاري برقم (1068) ومسلم برقم(880) .',
            1,
            0),
      ]),
      ZikerResponse(13, 'ما كان يقرأ به ﷺ  في ركعتي الفجـر', [
        HadithResponse(
            1,
            'سورة ( الكافرون و الإخلاص)' +
                '\nعن أبي هريرة رضي الله عنه أن رسول الله ﷺ قرأ في ركعتي الفجر {قُلْ يَأَيّهَا الْكَافِرُونَ} و{قُلْ هُوَ اللّهُ أَحَدٌ} ',
            'رواه الامام مسلم برقم (726) وأبو داود (1256) والنسائي (945) وابن ماجه (1148) ',
            1,
            0),
        HadithResponse(
            2,
           '(آية من سورة البقرة وآية من سورة  آل عمران)'+
            '\n- {قُولُوَاْ آمَنّا بِاللّهِ وَمَآ أُنْزِلَ إِلَيْنَا وَمَآ أُنزِلَ إِلَىَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالأسْبَاطِ وَمَآ أُوتِيَ مُوسَىَ وَعِيسَىَ وَمَا أُوتِيَ النّبِيّونَ مِن رّبّهِمْ لاَ نُفَرّقُ بَيْنَ أَحَدٍ مّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ} .البقرة '
            +'\n- {قُلْ يَأَهْلَ الْكِتَابِ تَعَالَوْاْ إِلَىَ كَلَمَةٍ سَوَآءٍ بَيْنَنَا وَبَيْنَكُمْ أَلاّ نَعْبُدَ إِلاّ اللّهَ وَلاَ نُشْرِكَ بِهِ شَيْئاً وَلاَ يَتّخِذَ بَعْضُنَا بَعْضاً أَرْبَاباً مّن دُونِ اللّهِ فَإِن تَوَلّوْاْ فَقُولُواْ اشْهَدُواْ بِأَنّا مُسْلِمُونَ} .آل عمران'+
            '\n- عن ابن عباس رضي الله عنه قال: كان رسول الله ﷺ يقرأ في ركعتي الفجر { قُولُوَاْ آمَنّا بِاللّهِ وَمَآ أُنْزِلَ إِلَيْنَا } والتي في آل عمران { تَعَالَوْاْ إِلَىَ كَلَمَةٍ سَوَآءٍ بَيْنَنَا وَبَيْنَكُمْ }. ',
             '- البقرة ( 136)'
            +'\n- آل عمران ( 64).'+
            '\n- رواه الامام مسلم برقم(727) وأبو داود (1259) والنسائي (944) ',
             1,
            0),
      ]),
      ZikerResponse(14, 'ما كان يقرأ به ﷺ  في صلاة الجمعة', [
        HadithResponse(
            1,
            'سورة (الجمعة والمنافقون)' +
                '\n عن ابن أبي رافع قال: استخلف مروان أبا هريرة - رضي الله عنه - على المدينة، وخرج إلى مكة فصلى لنا أبو هريرة الجمعة فقرأ بعد سورة الجمعة في الركعة الآخرة: {إِذَا جَآءَكَ الْمُنَافِقُونَ ...}، قال: فأدركت أبا هريرة رضي الله عنه حين انصرف فقلت له: إنك قرأت بسورتين كان علي بن أبي طالب رضي الله عنه يقرأ بهما بالكوفة. فقال أبو هريرة رضي الله عنه: إني سمعت رسول الله ﷺ يقرأ بهما يوم الجمعة. ',
            'رواه الامام مسلم برقم (877) وأبو داود برقم (1124).',
            1,
            0),
        HadithResponse(
            2,
            'سورة ( الاعلى و الغاشية)' +
                '\n- عن النعمان بن بشير رضي الله عنهما قال: كان رسول الله ﷺ يقرأ في العيدين وفي الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ} قال: وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضاً في الصلاتين). '
            +'\n- وعن سمرة بن جندب رضي الله عنه أن رسول الله ﷺ كان يقرأ في صلاة الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} (  ) و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ}.',
            'رواه الامام مسلم برقم (878) وأبو داود (1122) وابن خزيمة (1441).'+
            '\n- صحيح : رواه الامام أبوداود (1125) وابن خزيمة (1441) .',
            1,
            0),
      ]),
      ZikerResponse(15, 'ما كان يقرأ به ﷺ  في صلاة  العيدين', [
        HadithResponse(
            1,
            'سورة ( ق و القمر)' +
                '\nعن أبي واقد الليثي رضي الله عنه كان يقرأ ﷺ فيهما (الفطر والأضحى) بــ{قَ وَالْقُرْآنِ الْمَجِيدِ} و{اقْتَرَبَتِ السّاعَةُ وَانشَقّ الْقَمَرُ} .',
            'رواه الامام مسلم (891) وأبو داود (1154) وابن خزيمة (1440).',
            1,
            0),
        HadithResponse(
            2,
            'سورة ( الاعلى و الغاشية)' +
                '\nعن النعمان بن بشير رضي الله عنهما قال: كان رسول الله ﷺ يقرأ في العيدين وفي الجمعة بــ{سَبّحِ اسْمَ رَبّكَ الأعْلَىَ} ‏و{هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ} قال: وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضاً في الصلاتين). ',
            'رواه الامام مسلم برقم (878) وأبو داود (1122) وابن خزيمة (1441).',
            1,
            0),
      ]),
      ZikerResponse(16, 'ما كان يقرأ به ﷺ صلاة الكسوف والخسوف', [
        HadithResponse(
            1,
            'ما كان يقرأ به ﷺصلاة الكسوف والخسوف' +
                '\n- كان ﷺ يقرأ الفاتحة في كل ركعة وليس في القراءة بعدها في صلاة الكسوف أو الخسوف شيء محدد ، بل يقرأ فيها بما تيسر له من القرآن.' +
                '\nوالمستحب أن يطيل القراءة في الصلاة على طول مدة الكسوف أو الخسوف ، وقد أطال النبي ﷺ القراءة في صلاة الكسوف ، حتى كان القيام الأول بنحو سورة البقرة ،حتى ينتهي من الصلاة وقد انجلت الشمس . '+
                '\n- قال عبد الله بن عباس رضي الله عنهما : (خَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلًا نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ...)  '+
                '\n- قال الشيخ ابن عثيمين رحمه الله : "لم يعين ، سورة البقرة ، أو آل عمران ، أو النساء ، فالمهم أن تكون سورة طويلة ؛ لأن الذي جاء في الحديث أنها طويلة أي : يختار أطول ما يكون ، وقد سبق أن بعض الصحابة كان يسقط مغشيا عليه من طول القيام"  ',

            '- قال البهوتي رحمه الله: ومهما قرأ به من السور جاز لعدم تعين القراءة " انتهى من "كشاف القناع" (2/63) .' +
            '\n- متفق عليه : رواه الامام البخاري برقم  (993) ومسلم (1512)، قال الشيخ المباركفوري رحمه الله: " في الحديث دليل على مشروعية تطويل القيام بقراءة سورة طويلة في صلاة الكسوف، وهو مستحب عند الجميع.." انتهى من "مرعاة المفاتيح شرح مشكاة المصابيح " (5/136).' +
            '\n- قال البهوتي رحمه الله: ومهما قرأ به من السور جاز لعدم تعين القراءة " انتهى من "كشاف القناع" (2/63) .' +
                '\n- انتهى من "الشرح الممتع" (5/184) ',
            1,
            0),
      ]),
      ZikerResponse(17, 'ما كان يقرأ به ﷺ في صلاة الاستسقاء', [
        HadithResponse(
            1,
            'سورة ( الاعلى و الغاشية)' +
                'عن عبدِ اللهِ بن عبَّاسٍ رَضِيَ اللهُ عنهما، قال: ((خرَج النبيُّ صلَّى اللهُ عليه وسلَّم متواضعًا، متبذِّلًا، متخشِّعًا، مترسِّلًا، متضرِّعًا، فصلَّى رَكعتينِ كما يُصلِّي في العيد ، لم يخطُبْ خُطبتَكم هذه )) ' ,
            '- صلاةُ الاستسقاءِ ركعتانِ، يُكبِّر في الأولى سَبعًا، وفي الثانية خمسًا، وهذا مذهبُ الشافعيَّة، والحَنابِلَة، وبه قال بعضُ السَّلفِ، واختاره داودُ الظاهريُّ، وابنُ باز, وابنُ عثيمين ، والسُّنَّةُ الجهرُ بالقِراءةِ في صلاةِ الاستسقاءِ، وهو مذهب الجمهورِ: المالِكيَّة، والشَّافعيَّة، والحَنابِلَة، وحُكِي الإجماعُ على ذلك لأدلَّة منها :أولًا:  عن عبدِ اللهِ بنِ زيدٍ، قال: ((رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يوم خرَج يَستسقي، قال: فحوَّلَ إلى الناسِ ظَهرَه واستقبل القِبلةَ، ثم حوَّل رِداءَه، ثمَّ صلَّى لنا رَكعتينِ جهَر فيهما بالقِراءةِ  )) ثانيًا:  أنَّ هذه صلاةٌ شُرِعتْ لها الخُطبةُ؛ فكان مِن سُنَّتها الجهرُ كالجُمُعةِ والعِيدينِ ' + '\n- أخرجه مسلم (398).'
            +'\n- يقرأ في الأولى بعد تكبيرة الإحرام: الفاتحة وسورة الأعلى، وفي الثانية: الفاتحة وسورة الغاشية، يجهر فيهما بالقراءة، قال ابن قدامة  في "المغني": واختلفت الرواية في صفتها، فروي أنه يكبر فيهما كتكبير العيد سبعا في الأولى، وخمسا في الثانية، وهو قول سعيد بن المسيب، والشافعي.'
            +'\n- رواه أبو داود (1165)، والترمذي (558)، والنسائي (1521)، وابن ماجه (1266). قال الترمذيُّ: حسن صحيح. واحتجَّ به ابنُ حزم في ((المحلى)) (5/94)، وصحَّحه النوويُّ في ((المجموع)) (5/66)، وابن الملقِّن في ((البدر المنير)) (5/143)، وحسَّنه ابن حجر في ((نتائج الأفكار)) (1/476)، والألبانيُّ في ((صحيح ابن ماجه)) (1053).'
            ,
            1, 0),
      ]),
    ];

    return Future.value(listOfZikerModel);
  }
}
